app/Models/ModelAturan.php

SELECT *
FROM `tbl_aturan`
LEFT JOIN `tbl_keputusan` ON `tbl_keputusan`.`id_keputusan` = `tbl_aturan`.`id_keputusan`
ORDER BY `tbl_aturan`.`id_aturan` ASC
---
    public function getAllData()
    {
        return $this->db->table('tbl_aturan')
            ->join('tbl_keputusan', 'tbl_keputusan.id_keputusan = tbl_aturan.id_keputusan', 'left')
            ->orderBy('tbl_aturan.id_aturan', 'ASC')
            ->get()
            ->getResultArray();

SELECT *
FROM `tbl_detail_aturan`
LEFT JOIN `tbl_himpunan` ON `tbl_himpunan`.`id_himpunan` = `tbl_detail_aturan`.`id_himpunan`
LEFT JOIN `tbl_gejala` ON `tbl_gejala`.`id_gejala` = `tbl_himpunan`.`id_gejala`
WHERE `tbl_detail_aturan`.`id_aturan` = '1'
---
    public function getDetailAturan($id_aturan)
    {
        return $this->db->table('tbl_detail_aturan')
            ->join('tbl_himpunan', 'tbl_himpunan.id_himpunan = tbl_detail_aturan.id_himpunan', 'left')
            ->join('tbl_gejala', 'tbl_gejala.id_gejala = tbl_himpunan.id_gejala', 'left')
            ->where('tbl_detail_aturan.id_aturan', $id_aturan)
            ->get()
            ->getResultArray(); // Satu baris aja

SELECT *
FROM `tbl_aturan`
LEFT JOIN `tbl_keputusan` ON `tbl_keputusan`.`id_keputusan` = `tbl_aturan`.`id_keputusan`
WHERE `id_aturan` = 1
---
    public function getAturan($id_aturan)
    {
        return $this->db->table('tbl_aturan')
        ->join('tbl_keputusan', 'tbl_keputusan.id_keputusan = tbl_aturan.id_keputusan', 'left')
        ->where('id_aturan', $id_aturan)
        ->get()
        ->getRowArray();