app/Models/ModelSolusi.php

    public function getAllData()
    {
        return $this->db->table('tbl_solusi')
            ->join('tbl_penyakit', 'tbl_penyakit.id_penyakit = tbl_solusi.id_penyakit', 'left')
            ->orderBy('tbl_solusi.id_solusi', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `tbl_solusi`
LEFT JOIN `tbl_penyakit` ON `tbl_penyakit`.`id_penyakit` = `tbl_solusi`.`id_penyakit`
ORDER BY `tbl_solusi`.`id_solusi` ASC

    public function getCountPenyakit1()
    {
        return $this->db->table('tbl_riwayat')
            ->where('id_penyakit', 1)
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_riwayat`
WHERE `id_penyakit` = 1

    public function getCountPenyakit2()
    {
        return $this->db->table('tbl_riwayat')
            ->where('id_penyakit', 2)
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_riwayat`
WHERE `id_penyakit` = 2

    public function getCountPenyakit3()
    {
        return $this->db->table('tbl_riwayat')
            ->where('id_penyakit', 3)
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_riwayat`
WHERE `id_penyakit` = 3

    public function getSaranPenyakit($id_penyakit)
    {
        return $this->db->table('tbl_solusi')
            ->where('id_penyakit', $id_penyakit)
            ->get()
            ->getResultArray(); // Satu baris aja
---
SELECT *
FROM `tbl_solusi`
WHERE `id_penyakit` = '2'

    public function getAllDataPenyakit()
    {
        return $this->db->table('tbl_penyakit')
        ->orderBy('tbl_penyakit.id_penyakit', 'ASC')
        ->get()
        ->getResultArray();
---
SELECT *
FROM `tbl_penyakit`
ORDER BY `tbl_penyakit`.`id_penyakit` ASC