app/Models/ModelHimpunan.php

    public function getHimpunan($id_gejala)
    {
        return $this->db->table('tbl_himpunan')
            ->WHERE('id_gejala', $id_gejala)
            ->get()
            ->getResultArray();
---
SELECT *
FROM `tbl_himpunan`
WHERE `id_gejala` = '0'

    public function getDetailHimpunan($id_himpunan)
    {
        return $this->db->table('tbl_himpunan')
            ->join('tbl_gejala', 'tbl_gejala.id_gejala = tbl_himpunan.id_gejala', 'left')
            ->where('id_himpunan', $id_himpunan)
            ->get()
            ->getRowArray(); // Satu baris aja
---
SELECT *
FROM `tbl_himpunan`
LEFT JOIN `tbl_gejala` ON `tbl_gejala`.`id_gejala` = `tbl_himpunan`.`id_gejala`
WHERE `id_himpunan` = 1