app/Models/ModelPengguna.php

    public function getAllData()
    {
        return $this->db->table('tbl_riwayat')
            ->join('tbl_solusi', 'tbl_solusi.id_penyakit = tbl_riwayat.id_penyakit', 'left')
            ->orderBy('tanggal', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `tbl_riwayat`
LEFT JOIN `tbl_solusi` ON `tbl_solusi`.`id_penyakit` = `tbl_riwayat`.`id_penyakit`
ORDER BY `tanggal` ASC