app/Models/ModelKeputusan.php

SELECT *
FROM `tbl_keputusan`
ORDER BY `id_keputusan` ASC
---
    public function getAllData()
    {
        return $this->db->table('tbl_keputusan')
            ->orderBy('id_keputusan', 'ASC')
            ->get()
            ->getResultArray();