app/Models/ModelDeteksi.php

    public function addData($data)
    {
        $input_riwayat['nama'] = $data['nama'];
        $input_riwayat['umur'] = $data['umur'];
        $input_riwayat['jenis_kelamin'] = $data['jenis_kelamin'];
        $input_riwayat['domisili'] = $data['domisili'];
        $input_riwayat['tanggal'] = $data['tanggal'];
        //$input_riwayat['kode_deteksi'] = $data['kode_deteksi'];

        $this->db->table('tbl_riwayat')->insert($input_riwayat);

        $input_data['id_riwayat'] = $this->db->insertID();
        foreach ($data['id_gejala'] as $input_data['id_gejala'] => $input_data['data_deteksi']) {
            $this->db->table('tbl_deteksi')->insert($input_data);
        }

        foreach ($data['id_gejala_string'] as $input_data['id_gejala'] => $input_data['all_sub_gejala']) {
            $this->db->table('tbl_deteksi_string')->insert($input_data);
---
INSERT INTO `tbl_riwayat` (`nama`, `umur`, `jenis_kelamin`, `domisili`, `tanggal`) VALUES ('123', '123', 'p', '123', '2023-02-13 00:43:14')
INSERT INTO `tbl_deteksi` (`id_riwayat`, `data_deteksi`, `id_gejala`) VALUES (135, '3', 0)
INSERT INTO `tbl_deteksi_string` (`id_riwayat`, `data_deteksi`, `id_gejala`, `all_sub_gejala`) VALUES (135, '0', 0, 'Mual, Diare, Nyeri perut bagian sebelah kanan')

    public function deteksiRiwayat($id_riwayat)
    {
        return $this->db->table('tbl_deteksi')
        ->join('tbl_gejala', 'tbl_gejala.id_gejala = tbl_deteksi.id_gejala', 'left')
        ->where('id_riwayat', $id_riwayat)
        ->get()
        ->getResultArray(); // Satu baris aja
---
SELECT *
FROM `tbl_deteksi`
LEFT JOIN `tbl_gejala` ON `tbl_gejala`.`id_gejala` = `tbl_deteksi`.`id_gejala`
WHERE `id_riwayat` = '134'

    public function getDataDiri($id_riwayat)
    {
        return $this->db->table('tbl_riwayat')
        ->where('id_riwayat', $id_riwayat)
        ->get()
        ->getRowArray(); // Satu baris aja
---
SELECT *
FROM `tbl_riwayat`
WHERE `id_riwayat` = '134'


        $input_hasil['hasil'] = $hasil_dfz;
        $input_hasil['id_penyakit'] = $id_penyakit;
        $this->db->table('tbl_riwayat')->WHERE('id_riwayat', $id_riwayat)->update($input_hasil);
---
UPDATE `tbl_riwayat` SET `hasil` = 48.4, `id_penyakit` = '2'
WHERE `id_riwayat` = '134'

    public function getHasil($id_riwayat)
    {
        return $this->db->table('tbl_deteksi_string')
            ->where('id_riwayat', $id_riwayat)
            ->get()
            ->getResultArray(); // Satu baris aja
---
SELECT *
FROM `tbl_deteksi_string`
WHERE `id_riwayat` = '134'