app/Models/ModelAuth.php

SELECT *
FROM `tbl_admin`
WHERE `username` = 'admin1'
AND `password` = 'admin1'
---
    public function login_admin($username, $password)
    {
        return $this->db->table('tbl_admin')->where(
            [
                'username' => $username,
                'password' => $password
            ]
        )->get()->getRowArray();