app/Models/ModelSubgejala.php

    public function getAllData()
    {
        return $this->db->table('tbl_sub_gejala')
            ->join('tbl_gejala', 'tbl_gejala.id_gejala = tbl_sub_gejala.id_gejala', 'left')
            ->orderBy('tbl_gejala.id_gejala', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `tbl_sub_gejala`
LEFT JOIN `tbl_gejala` ON `tbl_gejala`.`id_gejala` = `tbl_sub_gejala`.`id_gejala`
ORDER BY `tbl_gejala`.`id_gejala` ASC

    public function getAllDataPerut()
    {
        return $this->db->table('tbl_sub_gejala')
            ->where('id_gejala', 0)
            ->get()
            ->getResultArray();
---
SELECT *
FROM `tbl_sub_gejala`
WHERE `id_gejala` = 0

    public function getAllDataFlu()
    {
        return $this->db->table('tbl_sub_gejala')
            ->where('id_gejala', 1)
            ->get()
            ->getResultArray();
---
SELECT *
FROM `tbl_sub_gejala`
WHERE `id_gejala` = 1

    public function getAllGejala()
    {
        return $this->db->table('tbl_gejala')
            ->orderBy('id_gejala', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `tbl_gejala`
ORDER BY `id_gejala` ASC