app/Models/ModelDeteksi.php

    public function deteksiRiwayat($id_riwayat)
    {
        return $this->db->table('tbl_deteksi')
        ->join('tbl_gejala', 'tbl_gejala.id_gejala = tbl_deteksi.id_gejala', 'left')
        ->where('id_riwayat', $id_riwayat)
        ->get()
        ->getResultArray(); // Satu baris aja
---
SELECT *
FROM `tbl_deteksi`
LEFT JOIN `tbl_gejala` ON `tbl_gejala`.`id_gejala` = `tbl_deteksi`.`id_gejala`
WHERE `id_riwayat` = '19'