app/Models/ModelGejala.php

SELECT *
FROM `tbl_gejala`
ORDER BY `id_gejala` ASC
---
    public function getAllData()
    {
        return $this->db->table('tbl_gejala')
            ->orderBy('id_gejala', 'ASC')
            ->get()
            ->getResultArray();